task1/benchmark/res/static_25_mariadb_nocache.txt
$ python3 httperf-plot.py --server ryan.dse.in.tum.de --port 8080 --num-conns 2000  --uri / --method GET --rate 100 --ramp-up 100,15
httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=100 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 20.012 s

Connection rate: 99.9 conn/s (10.0 ms/conn, <=3 concurrent connections)
Connection time [ms]: min 20.8 avg 21.7 max 25.7 median 21.5 stddev 0.4
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 99.9 req/s (10.0 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 99.6 avg 99.9 max 100.0 stddev 0.2 (4 samples)
Reply time [ms]: response 21.6 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 5.44 system 14.57 (user 27.2% system 72.8% total 100.0%)
Net I/O: 33.6 KB/s (0.3*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=200 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 10.017 s

Connection rate: 199.7 conn/s (5.0 ms/conn, <=6 concurrent connections)
Connection time [ms]: min 20.8 avg 21.4 max 28.0 median 21.5 stddev 0.5
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 199.7 req/s (5.0 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 199.2 avg 199.6 max 200.0 stddev 0.6 (2 samples)
Reply time [ms]: response 21.4 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 2.33 system 7.68 (user 23.3% system 76.7% total 100.0%)
Net I/O: 67.1 KB/s (0.5*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=300 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 6.684 s

Connection rate: 299.2 conn/s (3.3 ms/conn, <=7 concurrent connections)
Connection time [ms]: min 20.7 avg 21.2 max 23.3 median 21.5 stddev 0.2
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 299.2 req/s (3.3 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 298.8 avg 298.8 max 298.8 stddev 0.0 (1 samples)
Reply time [ms]: response 21.1 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 1.23 system 5.46 (user 18.3% system 81.7% total 100.0%)
Net I/O: 100.5 KB/s (0.8*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=400 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 5.019 s

Connection rate: 398.5 conn/s (2.5 ms/conn, <=11 concurrent connections)
Connection time [ms]: min 20.6 avg 21.3 max 30.0 median 21.5 stddev 0.5
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 398.5 req/s (2.5 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 398.4 avg 398.4 max 398.4 stddev 0.0 (1 samples)
Reply time [ms]: response 21.2 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.88 system 4.14 (user 17.6% system 82.4% total 100.0%)
Net I/O: 133.9 KB/s (1.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=500 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 4.019 s

Connection rate: 497.6 conn/s (2.0 ms/conn, <=12 concurrent connections)
Connection time [ms]: min 20.6 avg 21.3 max 23.4 median 21.5 stddev 0.3
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 497.6 req/s (2.0 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 21.2 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.60 system 3.42 (user 15.0% system 85.0% total 100.0%)
Net I/O: 167.2 KB/s (1.4*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=600 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 3.353 s

Connection rate: 596.5 conn/s (1.7 ms/conn, <=15 concurrent connections)
Connection time [ms]: min 20.5 avg 21.2 max 24.3 median 21.5 stddev 0.5
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 596.5 req/s (1.7 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 21.1 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.46 system 2.89 (user 13.8% system 86.2% total 100.0%)
Net I/O: 200.4 KB/s (1.6*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=700 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 2.877 s

Connection rate: 695.2 conn/s (1.4 ms/conn, <=18 concurrent connections)
Connection time [ms]: min 20.7 avg 21.4 max 29.1 median 21.5 stddev 0.5
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 695.2 req/s (1.4 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 21.3 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.34 system 2.53 (user 12.0% system 88.0% total 100.0%)
Net I/O: 233.6 KB/s (1.9*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=800 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 2.522 s

Connection rate: 793.1 conn/s (1.3 ms/conn, <=24 concurrent connections)
Connection time [ms]: min 21.0 avg 25.0 max 35.9 median 24.5 stddev 1.8
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 793.1 req/s (1.3 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 25.0 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.27 system 2.26 (user 10.6% system 89.4% total 100.0%)
Net I/O: 266.4 KB/s (2.2*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=900 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 2.244 s

Connection rate: 891.3 conn/s (1.1 ms/conn, <=27 concurrent connections)
Connection time [ms]: min 22.4 avg 24.6 max 34.2 median 24.5 stddev 1.8
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 891.3 req/s (1.1 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 24.6 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.21 system 2.04 (user 9.3% system 90.7% total 100.0%)
Net I/O: 299.4 KB/s (2.5*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=1000 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 2.023 s

Connection rate: 988.6 conn/s (1.0 ms/conn, <=31 concurrent connections)
Connection time [ms]: min 22.7 avg 25.9 max 36.6 median 25.5 stddev 2.1
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 988.6 req/s (1.0 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 25.8 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.17 system 1.85 (user 8.6% system 91.4% total 100.0%)
Net I/O: 332.1 KB/s (2.7*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=1100 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 1.843 s

Connection rate: 1085.0 conn/s (0.9 ms/conn, <=35 concurrent connections)
Connection time [ms]: min 22.7 avg 26.2 max 37.5 median 25.5 stddev 2.3
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 1085.0 req/s (0.9 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 26.2 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.16 system 1.68 (user 8.7% system 91.3% total 100.0%)
Net I/O: 364.5 KB/s (3.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=1200 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 1.692 s

Connection rate: 1181.8 conn/s (0.8 ms/conn, <=39 concurrent connections)
Connection time [ms]: min 23.0 avg 26.6 max 38.5 median 26.5 stddev 2.3
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 1181.8 req/s (0.8 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 26.5 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.11 system 1.58 (user 6.4% system 93.6% total 100.0%)
Net I/O: 397.0 KB/s (3.3*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=1300 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 1.560 s

Connection rate: 1282.3 conn/s (0.8 ms/conn, <=43 concurrent connections)
Connection time [ms]: min 21.8 avg 27.4 max 38.0 median 26.5 stddev 2.7
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 1282.3 req/s (0.8 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 27.4 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.10 system 1.46 (user 6.2% system 93.7% total 99.9%)
Net I/O: 430.8 KB/s (3.5*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=1400 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 1.458 s

Connection rate: 1371.7 conn/s (0.7 ms/conn, <=46 concurrent connections)
Connection time [ms]: min 21.2 avg 27.1 max 38.8 median 26.5 stddev 3.0
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 1371.7 req/s (0.7 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 27.1 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.08 system 1.37 (user 5.7% system 94.2% total 99.9%)
Net I/O: 460.8 KB/s (3.8*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=1500 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 2

Total: connections 2000 requests 2000 replies 2000 test-duration 1.339 s

Connection rate: 1494.0 conn/s (0.7 ms/conn, <=49 concurrent connections)
Connection time [ms]: min 4.3 avg 13.5 max 38.0 median 7.5 stddev 10.4
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 1494.0 req/s (0.7 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 13.4 transfer 0.0
Reply size [B]: header 292.0 content 1744.0 footer 2.0 (total 2038.0)
Reply status: 1xx=0 2xx=0 3xx=619 4xx=0 5xx=1381

CPU time [s]: user 0.17 system 1.17 (user 12.6% system 87.3% total 99.9%)
Net I/O: 3075.8 KB/s (25.2*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0